<a href="https://colab.research.google.com/github/BrunoFutema/BrunoFutema/blob/master/Atividade6.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [10]:
import matplotlib.pyplot as plt

In [2]:
from google.colab import files
uploaded = files.upload()

Saving basecensus.csv to basecensus.csv

In [3]:
df = pd.DataFrame(pd.read_csv('basecensus.csv'))

## RA: 81820360 - Bruno Amaral Futema
## RA: 81727341 - Camila Gomes dos Reis Mattos
## RA: 81823402 - Douglas Oliveira dos Santos
## RA: 81721367 - Fernanda Soares dos Reis
## RA: 81823608 - Jhonatan da Costa

# Contagem dos dados agrupados por sexo, educação e income - Variável alvo: Quantidade de pessoas que ganham mais ou menos que 50K

In [31]:
sex_education_income = pd.DataFrame(df.groupby(by=['sex', 'education'])['income'].value_counts())
pd.DataFrame(df.groupby(by=['sex', 'education'])['income'].value_counts())

                              income
sex     education     income
 Female  10th          <=50K     248
                       >50K        2
         11th          <=50K     363
                       >50K        8
         12th          <=50K     120
...                              ...
 Male    Preschool     <=50K      31
         Prof-school   >50K      364
                       <=50K      91
         Some-college  <=50K    3020
                       >50K     1151

[61 rows x 1 columns]

In [34]:
# sex_education_income.columns = ['sex', 'education', 'income', 'count']
sex_education_income['income']

sex      education      income
 Female   10th           <=50K     248
                         >50K        2
          11th           <=50K     363
                         >50K        8
          12th           <=50K     120
                                  ...
 Male     Preschool      <=50K      31
          Prof-school    >50K      364
                         <=50K      91
          Some-college   <=50K    3020
                         >50K     1151
Name: income, Length: 61, dtype: int64

# Contagem dos dados agrupados por nível de educação e sexo - Variável alvo: Quantidade mulheres e homens agrupadas por nível de educação

In [5]:
pd.DataFrame(df.groupby(by=['sex'])['education'].value_counts())

                       education
sex     education
 Female  HS-grad            3106
         Some-college       2507
         Bachelors          1522
         Masters             509
         Assoc-voc           455
         Assoc-acdm          395
         11th                371
         10th                250
         7th-8th             132
         12th                122
         9th                 119
         Prof-school          87
         Doctorate            81
         5th-6th              69
         1st-4th              43
         Preschool            14
 Male    HS-grad            6734
         Some-college       4171
         Bachelors          3522
         Masters            1118
         Assoc-voc           852
         11th                677
         Assoc-acdm          613
         10th                570
         Prof-school         455
         7th-8th             425
         9th                 336
         Doctorate           294
         12th                255
         5th-6th             219
         1st-4th             108
         Preschool            31

# Contagem dos dados agrupados por workclass e education - Variável alvo: Quantidade de pessoas por cada tipo de trabalho agrupadas por nível de educação

In [6]:
pd.DataFrame(df.groupby(by=['workclass'])['education'].value_counts())

                            education
workclass    education
 Federal-gov  HS-grad             260
              Some-college        251
              Bachelors           207
              Masters              65
              Assoc-acdm           55
...                               ...
 State-gov    Preschool             1
 Without-pay  HS-grad               9
              Some-college          3
              7th-8th               1
              Assoc-acdm            1

[96 rows x 1 columns]

# Contagem dos dados agrupados por race e education - Variável alvo: Quantidade de pessoas agrupadas por raça e nível de educação

In [7]:
pd.DataFrame(df.groupby(by=['race'])['education'].value_counts())

                                   education
race                education
 Amer-Indian-Eskimo  HS-grad             116
                     Some-college         71
                     Bachelors            20
                     Assoc-voc            16
                     10th                 14
...                                      ...
 White               Doctorate           338
                     12th                306
                     5th-6th             242
                     1st-4th             123
                     Preschool            33

[79 rows x 1 columns]

# Contagem dos dados agrupados por race - Variável alvo: Quantidade de pessoas agrupadas por raça

In [8]:
pd.DataFrame(df['race'].value_counts())

                      race
 White               25933
 Black                2817
 Asian-Pac-Islander    895
 Amer-Indian-Eskimo    286
 Other                 231

# Contagem dos dados agrupados por sexo - Variável alvo: Quantidade de homens e mulheres

In [9]:
pd.DataFrame(df['sex'].value_counts())

           sex
 Male    20380
 Female   9782